{"config": [{"config": {"name": "zero_padding2d_1", "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "data_format": "channels_last", "padding": [[2, 2], [2, 2]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "data_format": "channels_last", "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "zero_padding2d_2", "data_format": "channels_last", "padding": [[2, 2], [2, 2]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_2", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "data_format": "channels_last", "filters": 128}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "zero_padding2d_3", "data_format": "channels_last", "padding": [[2, 2], [2, 2]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_3", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "data_format": "channels_last", "filters": 256}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "zero_padding2d_4", "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_4", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "data_format": "channels_last", "filters": 256}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "zero_padding2d_5", "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_5", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "zero_padding2d_6", "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_6", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "data_format": "channels_last", "filters": 512}, "class_name": "Conv2D"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "zero_padding2d_7", "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_7", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "data_format": "channels_last", "filters": 1024}, "class_name": "Conv2D"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_3", "rate": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "zero_padding2d_8", "data_format": "channels_last", "padding": [[1, 1], [1, 1]], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_8", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "strides": [1, 1], "kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "trainable": true, "activation": "linear", "data_format": "channels_last", "filters": 1024}, "class_name": "Conv2D"}, {"config": {"name": "activation_8", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_4", "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_4", "rate": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1", "activity_regularizer": null, "units": 2048, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_2", "activity_regularizer": null, "units": 128, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 2.0, "mode": "fan_in", "distribution": "normal", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "activation": "relu", "trainable": true}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_3", "activity_regularizer": null, "units": 10, "bias_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "2.0.2", "backend": "tensorflow"}